#+title:  CSE1500 Web Technology Notes
#+author: Berken Tekin
#+OPTIONS: ^:{}
#+TAGS: CSE1500, StudyNotes
#+STARTUP: inlineimages

*** [[https://developer.mozilla.org/en-US/docs/Glossary/Hoisting][Hoisting]]
    - Hoisting :: allows functions to be safely used in code /before/ they are declared.
    - Variables can also be hoisted, however; _JS does not hoist initializations_ Take a look at the following code:
      #+begin_src js
	// Returns undefined from hoisted var declaration (not 6)
	console.log(num);
	
	// Declaration and initialization
	var num = 6; 
	
	// Returns 6 after the line with initialization is executed.
	console.log(num);
	
      #+end_src

      #+RESULTS:
      : undefined
      : 6
      : undefined
      - This rule applies for function expressions as well. If you define a variable as a function, the expression won't be hoisted.
      - Variable/function /declarations/ are hoisted:
        #+begin_src js
	  f();
	  console.log(x); // 5
	  console.log(y); // 3
	  function f() { // function declaration
		      x = 5; // global scope
		      y = 3; // global scope
	  }
	  
        #+end_src

	#+RESULTS:
	: 5
	: 3
	: undefined
